Охотники_и_рыболовы/src/Documents/ПутевкаДоговор/ПутевкаДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевкаДоговор</name>
  <basedOn>Document.РазрешениеНаОхоту</basedOn>
  <registerRecords>AccumulationRegister.ПродажаПутевок</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазрешениеНаОхоту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Охотники_и_рыболовы/src/InformationRegisters/ЦеныПоВидамДичи/ЦеныПоВидамДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоВидамДичи</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаСвоимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСвоимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаШтатнымСотрудникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаВетеранамВойны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаИнвалидамПервойГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПослеВозрастногоПорога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоСезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеОсобыхЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/РазрешениеНаОхоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазрешениеНаОхоту</name>
  <basedOn>Catalog.Охотники</basedOn>
  <registerRecords>AccumulationRegister.ДобытаяДичь</registerRecords>
  <registerRecords>AccumulationRegister.КвотыОхотхозяйства</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаРазрешений</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевкаДоговор</name>
    <type>
      <types>DocumentRef.ПутевкаДоговор</types>
    </type>
  </attributes>
  <attributes>
    <name>БезПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктМПР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявление</name>
    <type>
      <types>DocumentRef.Заявление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДобытаяДичь</name>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобычи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/Catalogs/Охотники/Охотники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Охотники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвалид1Группы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВетеранВОВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтатныйСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленККОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/ChartsOfCharacteristicTypes/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>НастройкиПользователей</name>
  <type>
    <types>CatalogRef.Охотхозяйства</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Пользователи</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <predefined>
    <items>
      <name>ОсновнаяОрганизация</name>
      <description>Основная организация</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Охотхозяйства</types>
      </type>
    </items>
    <items>
      <name>ОсновнойОтветственный</name>
      <description>Основной ответственный</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Охотники_и_рыболовы/src/Documents/ПутевкаДоговор/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийСезон = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	
	Если ТекущийСезон.Пустая() Тогда
		ТекстСообщения = "Сезон охоты не открыт";
		Поле = "Объект.СезонОхоты";
		ОхотаСервер.ПоказатьСообщение(ТекстСообщения,Поле);
		Отказ = Истина;
		Возврат;
	Иначе
		Если Объект.СезонОхоты.Пустая() Тогда 
			Объект.СезонОхоты = ТекущийСезон;
		КонецЕсли;
		Элементы.СезонОхоты.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ДокументОснование = Объект.ДокументОснование;
	БезПроверки = ДокументОснование.БезПроверки;
	
	ОснОтветственный = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный");
	
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОтветственный);	
	КонецЕсли;	
	
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.Охотхозяйство.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Сезонная = ДокументОснование.Сезонная;
		ОснОрганизация = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация");
		
		Охотхозяйство = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОрганизация);
		Если Объект.Охотхозяйство.Пустая() Тогда
			Объект.Охотхозяйство = Охотхозяйство;
		КонецЕсли;	
		
		Если Объект.МестоОхоты.Пустая() Тогда
			Объект.МестоОхоты = Охотхозяйство;
		КонецЕсли;	
	Иначе	
		
		ПолучитьПериодыОхоты(Истина);
	КонецЕсли;
	
	СтоимостьАктуальная = ПолучитьСтоимостьПутевки(ПолучитьПараметрыДанных());
	
	Если Объект.Ссылка.Пустая() И Объект.Стоимость = 0 Тогда
		Объект.Стоимость = СтоимостьАктуальная;
	КонецЕсли;
	
	ПараметрыВыбораПоСубъекту = ОхотаСерверПовтИсп.ПолучитьПараметрыВыбораПоСубъектуРФ();
	Элементы.МестоОхоты.ПараметрыВыбора = ПараметрыВыбораПоСубъекту;
	Элементы.Охотхозяйство.ПараметрыВыбора = ПараметрыВыбораПоСубъекту;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Если НЕ Объект.Стоимость = СтоимостьАктуальная Тогда
		Элементы.Скорректировать.Видимость = Истина;
		Элементы.СтоимостьАктуальна.Заголовок = "Стоимость не актуальна";
		Элементы.СтоимостьАктуальна.ЦветТекста = ЦветаСтиля.Некорректно;
	Иначе 	
		Элементы.Скорректировать.Видимость = Ложь;		
		Элементы.СтоимостьАктуальна.Заголовок = "Стоимость актуальна";
		Элементы.СтоимостьАктуальна.ЦветТекста = ЦветаСтиля.Корректно;
	КонецЕсли;
	
	Если Объект.Охотхозяйство.Пустая() ИЛИ Объект.МестоОхоты.Пустая() ИЛИ
		Объект.Охотник.Пустая() ИЛИ Объект.ВидДичи.Пустая() Тогда
		Элементы.ПериодОхоты.ТолькоПросмотр = Истина;
		Элементы.ДатаНачала.ТолькоПросмотр = Истина;
		Элементы.ДатаОкончания.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ПериодОхоты.ТолькоПросмотр = Ложь;
		Элементы.ДатаНачала.ТолькоПросмотр = Ложь;
		Элементы.ДатаОкончания.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
	Если Объект.ДокументОснование.Пустая() Тогда
		Элементы.Группа1.ТолькоПросмотр =Ложь;
		Элементы.Группа3.ТолькоПросмотр =Ложь;
		Элементы.Группа8.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Группа1.ТолькоПросмотр = Истина;
		Элементы.Группа3.ТолькоПросмотр = Истина;
		Элементы.Группа8.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьПутевки(ПараметрыДанных)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&СезонОхоты,
	|	&Охотхозяйство,
	|	&МестоОхоты,
	|	ВЫРАЗИТЬ(&Охотник КАК Справочник.Охотники) КАК Охотник,
	|	&ВидДичи,
	|	&Сезонная,
	|	&ДатаНачала,
	|	&ДатаОкончания,
	|	&Дата
	|ПОМЕСТИТЬ ПутевкаДоговор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПутевкаДоговор.Охотник.ШтатныйСотрудник
	|			ТОГДА ЕСТЬNULL(ЦеныПоВидам.ЦенаШтатнымСотрудникам, 0)
	|		ИНАЧЕ 999999999
	|	КОНЕЦ КАК ЦенаШтатномуСотруднику,
	|	ВЫБОР
	|		КОГДА ПутевкаДоговор.Охотник.ВетеранВОВ
	|			ТОГДА ЕСТЬNULL(ЦеныПоВидам.ЦенаВетеранамВойны, 0)
	|		ИНАЧЕ 999999999
	|	КОНЕЦ КАК ЦенаВетерануВОВ,
	|	ВЫБОР
	|		КОГДА ПутевкаДоговор.Охотник.Инвалид1Группы
	|			ТОГДА ЕСТЬNULL(ЦеныПоВидам.ЦенаИнвалидамПервойГруппы, 0)
	|		ИНАЧЕ 999999999
	|	КОНЕЦ КАК ЦенаИнвалидуПервойГруппы,
	|	ВЫБОР
	|		КОГДА ГОД(ПутевкаДоговор.Дата) - ГОД(ПутевкаДоговор.Охотник.ДатаРождения) >= &ВозрастнойПорог
	|			ТОГДА ЕСТЬNULL(ЦеныПоВидам.ЦенаПослеВозрастногоПорога, 0)
	|		ИНАЧЕ 999999999
	|	КОНЕЦ КАК ЦенаПоВозрасту,
	|	ВЫБОР
	|		КОГДА ПутевкаДоговор.Охотник.ЧленОООР
	|			ТОГДА ВЫБОР
	|					КОГДА ПутевкаДоговор.Охотник.ЧленККОООР = ИСТИНА
	|						ТОГДА ВЫБОР
	|								КОГДА ПутевкаДоговор.Сезонная
	|										ИЛИ ЦеныПоВидам.ТолькоСезонная
	|									ТОГДА ЕСТЬNULL(ЦеныПоВидам.ЦенаСвоимСезонная, 0)
	|								ИНАЧЕ ЕСТЬNULL(ЦеныПоВидам.ЦенаСвоимРазовая, 0) * РАЗНОСТЬДАТ(ПутевкаДоговор.ДатаНачала, ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ПутевкаДоговор.ДатаОкончания, ДЕНЬ), СЕКУНДА, 1), ДЕНЬ)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПутевкаДоговор.Сезонная
	|									ИЛИ ЦеныПоВидам.ТолькоСезонная
	|								ТОГДА ЕСТЬNULL(ЦеныПоВидам.ЦенаЧужимСезонная, 0)
	|							ИНАЧЕ ЕСТЬNULL(ЦеныПоВидам.ЦенаЧужимРазовая, 0) * РАЗНОСТЬДАТ(ПутевкаДоговор.ДатаНачала, ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ПутевкаДоговор.ДатаОкончания, ДЕНЬ), СЕКУНДА, 1), ДЕНЬ)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПутевкаДоговор.Сезонная
	|						ИЛИ ЦеныПоВидам.ТолькоСезонная
	|					ТОГДА ЕСТЬNULL(ЦеныПоВидам.ТолькоГосБилетСезонная, 0)
	|				ИНАЧЕ ЕСТЬNULL(ЦеныПоВидам.ТолькоГосБилетРазовая, 0) * РАЗНОСТЬДАТ(ПутевкаДоговор.ДатаНачала, ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ПутевкаДоговор.ДатаОкончания, ДЕНЬ), СЕКУНДА, 1), ДЕНЬ)
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьПутевки,
	|	ЕСТЬNULL(ЦеныПоВидам.ДействиеОсобыхЦен, ЛОЖЬ) КАК ДействиеОсобыхЦен
	|ИЗ
	|	ПутевкаДоговор КАК ПутевкаДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(&Дата, ) КАК ЦеныПоВидам
	|		ПО ПутевкаДоговор.СезонОхоты = ЦеныПоВидам.СезонОхоты
	|			И ПутевкаДоговор.ВидДичи = ЦеныПоВидам.ВидДичи
	|			И (ПутевкаДоговор.ДатаНачала МЕЖДУ ЦеныПоВидам.ДатаНачала И ЦеныПоВидам.ДатаОкончания)
	|			И (ПутевкаДоговор.ДатаОкончания МЕЖДУ ЦеныПоВидам.ДатаНачала И ЦеныПоВидам.ДатаОкончания)"; 		
	
	Для каждого КлючИЗначение Из ПараметрыДанных Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ,КлючИЗначение.Значение);
	КонецЦикла;	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтоимостьПутевки = 0;
	
	Охотник = ПараметрыДанных.Охотник;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДействиеОсобыхЦен Тогда
			Стоимость = 999999999;
			
			Если Охотник.ШтатныйСотрудник Тогда
				Стоимость = Выборка.ЦенаШтатномуСотруднику;
			КонецЕсли;	
			
			Если Охотник.ВетеранВОВ Тогда
				Стоимость = Выборка.ЦенаВетерануВОВ;
			КонецЕсли;	
			
			Если Охотник.Инвалид1Группы Тогда
				Стоимость = Выборка.ЦенаИнвалидуПервойГруппы;
			КонецЕсли;	
			
			ВозрастОхотника = Год(ПараметрыДанных.Дата) - Год(Охотник.ДатаРождения);
			
			Если ВозрастОхотника >= ПараметрыДанных.ВозрастнойПорог И ВозрастОхотника < 100 Тогда
				Стоимость = Выборка.ЦенаПоВозрасту;
			КонецЕсли;	
		
		
			СтоимостьПутевки = Мин(Стоимость,Выборка.СтоимостьПутевки);	
		Иначе
			СтоимостьПутевки = Выборка.СтоимостьПутевки;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СтоимостьПутевки	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	ИмяМакета = Команда.Имя;
	
	Если Не ПроверитьВозможностьПечати(ИмяМакета) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуПечати(ИмяМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПечати(ИмяМакета)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ИмяМакета",ИмяМакета);
	ПараметрыПечати.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыПечати,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьПечати(ИмяМакета)
	Если ПустаяСтрока(Объект.СерияПутевки) Тогда
		Текст = "Не заполнена серия путевки";
		Поле = "Объект.СерияПутевки";
		ПоказатьСообщениеНаСервере(Текст,Поле);
		Возврат Ложь;
	ИначеЕсли ПустаяСтрока(Объект.НомерПутевки) Тогда
		Текст = "Не заполнен номер путевки";
		Поле = "Объект.НомерПутевки";
		ПоказатьСообщениеНаСервере(Текст,Поле);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Объект.Проведен Тогда
		Описание = Новый ОписаниеОповещения("ПроверкаВозможностиПечатиЗавершение",ЭтаФорма,ИмяМакета);
		ПоказатьВопрос(Описание,"Документ не проведен.Для печати его необходимо провести.
		|Провести документ?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		
		Возврат Ложь;					
	КонецЕсли;
	
	Если Модифицированность Тогда
		Описание = Новый ОписаниеОповещения("ПроверкаВозможностиПечатиЗавершение",ЭтаФорма,ИмяМакета);
		ПоказатьВопрос(Описание,"Документ изменен. Для печати его необходимо провести.
		|Провести документ?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		
		Возврат Ложь;					
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроведенДокументОснование()
	Возврат Объект.ДокументОснование.Проведен;	
КонецФункции

&НаКлиенте
Процедура ПроверкаВозможностиПечатиЗавершение(РезультатВопроса,ИмяМакета) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ДокументОснование.Пустая() И НЕ ПроведенДокументОснование() Тогда
		//Надо провести разрешение, а потом путевку
		Описание = Новый ОписаниеОповещения("ДокументОснованиеПроведение",ЭтаФорма,ИмяМакета);
		ПоказатьВопрос(Описание,"Необходимо сначала провести документ основание",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;	
	
	Отказ = Ложь;
	Попытка
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
		Если НЕ ЭтаФорма.Записать(ПараметрыЗаписи) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ИнформацияОбОшибке().Описание);		
			Отказ  = Истина;		
		КонецЕсли;
		
		
	Исключение
		Отказ = Истина;
		Текст = ОписаниеОшибки(); 
		Поле = "Объект";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,Поле);
		
	КонецПопытки;
	
	Если НЕ Отказ Тогда
		ОткрытьФормуПечати(ИмяМакета);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ДокументОснованиеПроведение(РезультатВопроса,ИмяМакета) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗаписатьДокументОснование() Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаВозможностиПечатиЗавершение(КодВозвратаДиалога.Да,ИмяМакета)
КонецПроцедуры

&НаСервере
Функция ЗаписатьДокументОснование()
	
	ДокументОснование = Объект.ДокументОснование.ПолучитьОбъект();
	Попытка
		ДокументОснование.Записать();
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если НЕ ВладелецФормы = Неопределено Тогда
		Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") тогда
			Оповестить("СформироватьСтрокуПутевки",Объект.Ссылка,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ Объект.ДокументОснование.Пустая() И ПолучитьРеквизитДокумента(Объект.ДокументОснование,"ПутевкаДоговор").Пустая() Тогда
		УстановитьРеквизитВРазрешении();	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизитВРазрешении();	
	ДокРазрешение = Объект.ДокументОснование.ПолучитьОбъект();
	ДокРазрешение.ПутевкаДоговор = Объект.Ссылка;
	Попытка
		ДокРазрешение.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
	КонецПопытки;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьРеквизитДокумента(СсылкаДокумента,ИмяРеквизита)
	Возврат СсылкаДокумента[ИмяРеквизита];	
КонецФункции	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроизвольныйПериодПриИзменении(Неопределено);
	Если НЕ ВладелецФормы = Неопределено И ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		Элементы.ГруппаСезоннаяРазоваяПроизвольный.Видимость = ВладелецФормы.Элементы.ГруппаСезоннаяРазоваяПроизвольный.Видимость;
	КонецЕсли;	
	
	УстановитьДоступностьЭлементов();
	УстановитьЗаголовокДокументаОснования();
	Если НЕ ЗначениеЗаполнено(Объект.ВидДичи) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		ПериодОхоты = ("с " + Формат(Объект.ДатаНачала, "ДФ ='дд.ММ.гггг'") + " по " +  Формат(Объект.ДатаОкончания, "ДФ ='дд.ММ.гггг'"));
		Элементы.ПериодОхоты.СписокВыбора.Добавить(ПериодОхоты,ПериодОхоты);
	КонецЕсли;
	
	УстановитьСуммуПрописью();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокДокументаОснования()
	Если НЕ Объект.ДокументОснование.Пустая() Тогда
		Элементы.НаименованиеДокументаОснования.Заголовок = Объект.ДокументОснование;
		Элементы.СерияРазрешения.Заголовок = "Серия " + Объект.СерияРазрешения;
		Элементы.НомерРазрешения.Заголовок = " Номер " +Объект.НомерРазрешения;
	Иначе
		Элементы.НаименованиеДокументаОснования.Заголовок = "Создать на основании";
		Элементы.НаименованиеДокументаОснования.Гиперссылка = Истина;
		Элементы.СерияРазрешения.Заголовок = "";
		Элементы.НомерРазрешения.Заголовок = "";
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
	УстановитьСуммуПрописью();
КонецПроцедуры

&НаКлиенте
Процедура ОхотникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОхотникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если СтрДлина(Текст) < 2 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьСуммуПрописью()
	Если Объект.Стоимость > 0 Тогда
		СуммаПрописью = ЧислоПрописью(Объект.Стоимость,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		
		Элементы.СуммаПрописью.Заголовок = "Стоимость путевки составила: " + СуммаПрописью;
	Иначе
		Элементы.СуммаПрописью.Заголовок = "Стоимость не установлена";
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДокументаОснованияНажатие(Элемент)
	
	Если Объект.ДокументОснование.Пустая() Тогда
		ОткрытьФорму("Документ.РазрешениеНаОхоту.Форма.ФормаВыбора",,ЭтаФорма,УникальныйИдентификатор);
	Иначе
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ",Объект.ДокументОснование);
		Если ВладелецФормы = Неопределено ИЛИ ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
			ИдентификаторФормы = УникальныйИдентификатор;
			ОткрытьФорму("Документ.РазрешениеНаОхоту.Форма.ФормаДокумента",ПараметрыОткрытия,ЭтаФорма, ИдентификаторФормы);	
		Иначе
			Если ВладелецФормы.Объект.Ссылка = Объект.ДокументОснование Тогда
				ВладелецФормы.Активизировать();
			Иначе
				ОткрытьФорму("Документ.РазрешениеНаОхоту.Форма.ФормаДокумента",ПараметрыОткрытия,ЭтаФорма, ИдентификаторФормы);	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтоимость(Команда)
	ОбновитьСтоимостьНаСервере();
	
	УстановитьДоступностьЭлементов();
	УстановитьСуммуПрописью();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтоимостьНаСервере()
	СтоимостьНеАктуальная = Объект.Стоимость; 
	Объект.Стоимость = СтоимостьАктуальная;
	Попытка
		Записать();
	Исключение
		ТекстОшибки = ОбщегоНазначения.СформироватьТекстСообщения(ОписаниеОшибки());	
		ОбщегоНазначения.СформироватьЗаписьЖурналаРегистрации("Данные.Проведение",УровеньЖурналаРегистрации.Ошибка,Объект.Ссылка.Метаданные(),Объект.Ссылка,ТекстОшибки);		
		Объект.Стоимость = СтоимостьНеАктуальная;
	КонецПопытки;
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПоказатьСообщениеНаСервере(Текст,Поле)
	ОхотаСервер.ПоказатьСообщение(Текст,Поле);	
КонецПроцедуры

&НаКлиенте
Процедура ВидДичиПриИзменении(Элемент)
	СтоимостьАктуальная = ПолучитьСтоимостьПутевки(ПолучитьПараметрыДанных());
	Объект.Стоимость = СтоимостьАктуальная;
	
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидДичиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ Объект.ВидДичи.Пустая() Тогда
		ПредыдущийВидДичи = Объект.ВидДичи;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.МестоОхоты) Тогда
		Текст = "Необходимо заполнить место охоты";
		Поле = "Объект.МестоОхоты";
		ПоказатьСообщениеНаСервере(Текст,Поле);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДичи(ВидДичи)
	
	Если ВидДичи.Пустая() Тогда
		Возврат Новый СписокЗначений;
	Иначе
		Возврат ОхотаСерверПовтИсп.ПолучитьСписокДичи(ВидДичи,Ложь);	
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ПроизвольныйПериодПриИзменении(Элемент)
	Элементы.ГруппаПроизвольныйПериод.Видимость = Объект.ПроизвольныйПериод;
	Элементы.ПериодОхоты.Видимость = НЕ Объект.ПроизвольныйПериод;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОхотыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ВидДичи.Пустая() Тогда
		Текст = "Не заполнен вид дичи.
		|Невозможно подобрать актуальные периоды охоты!";
		Поле = "Объект.ВидДичи";
		ПоказатьСообщениеНаСервере(Текст,Поле);
		Возврат;
	КонецЕсли;	
	
	ПодобратьПериодыОхоты();
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОхотыПриИзменении(Элемент)
	ТекстДатаНачала = Сред(ПериодОхоты,3,10);
	ТекстДатаОкончания = Прав(ПериодОхоты,10);
	
	ДатаНачала = Дата(Прав(ТекстДатаНачала,4) + Сред(ТекстДатаНачала,4,2) + Лев(ТекстДатаНачала,2));
	ДатаОкончания = Дата(Прав(ТекстДатаОкончания,4) + Сред(ТекстДатаОкончания,4,2) + Лев(ТекстДатаОкончания,2));
	
	Объект.ДатаНачала = ДатаНачала;
	Объект.ДатаОкончания = ДатаОкончания;
	
	СтоимостьАктуальная = ПолучитьСтоимостьПутевки(ПолучитьПараметрыДанных());
	Объект.Стоимость = СтоимостьАктуальная;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПериодыОхоты(ПриСоздании = Ложь)
	мПериоды = ОхотаСервер.ПолучитьПериодыОхоты(Объект); 
	Если мПериоды.Пустой() И НЕ ПриСоздании Тогда
		Текст = "Не определены периоды охоты";
		Поле = "Объект";
		ОхотаСервер.ПоказатьСообщение(Текст,Поле);
		Возврат;
	Иначе
		Периоды = мПериоды.Выгрузить();
		СтруктураОтбора = Новый Структура("ВидДичи",Объект.ВидДичи);
		Строки = Периоды.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() = 0 И НЕ ПриСоздании Тогда
			Текст = "Не определены периоды охоты";
			Поле = "Объект.ВидДичи";
			ОхотаСервер.ПоказатьСообщение(Текст,Поле);
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ПриСоздании Тогда
		ТолькоСезонная = Истина;
		Для каждого стр из Периоды Цикл
			ТолькоСезонная = ТолькоСезонная И стр.ТолькоСезонная;
		КонецЦикла;		
		
		Элементы.ГруппаСезоннаяРазоваяПроизвольный.Видимость = НЕ ТолькоСезонная;
		Объект.Сезонная = ?(ТолькоСезонная,Истина,Объект.Сезонная);
		Объект.ПроизвольныйПериод = ?(ТолькоСезонная,Ложь,Объект.ПроизвольныйПериод);
	КонецЕсли;	
	
	ЗначениеВРеквизитФормы(Периоды,"ПериодыОхоты");
	
	
КонецПроцедуры
&НаСервере
Процедура ПодобратьПериодыОхоты()
	
	Периоды = РеквизитФормыВЗначение("ПериодыОхоты");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВрТаб.ВидДичи,
	|	ВрТаб.ДатаНачала,
	|	ВрТаб.ДатаОкончания,
	|	ВрТаб.РазоваяДатаНачала,
	|	ВрТаб.РазоваяДатаОкончания,
	|	&Сезонная
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	&ВрТаб КАК ВрТаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.ВидДичи,
	|	ВЫБОР
	|		КОГДА Периоды.Сезонная
	|			ТОГДА Периоды.ДатаНачала
	|		ИНАЧЕ Периоды.РазоваяДатаНачала
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА Периоды.Сезонная
	|			ТОГДА Периоды.ДатаОкончания
	|		ИНАЧЕ Периоды.РазоваяДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания
	|ИЗ
	|	Периоды КАК Периоды
	|ГДЕ
	|	Периоды.ВидДичи = &ВидДичи
	|	И ВЫБОР
	|			КОГДА Периоды.Сезонная
	|				ТОГДА НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) <= КОНЕЦПЕРИОДА(Периоды.ДатаОкончания, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(Периоды.РазоваяДатаНачала, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ВидДичи", Объект.ВидДичи);
	Запрос.УстановитьПараметр("ВрТаб",Периоды);
	Запрос.УстановитьПараметр("Сезонная",Объект.Сезонная);
	Запрос.УстановитьПараметр("Дата",?(Объект.Дата = '00010101',ТекущаяДата(),Объект.Дата));
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Если Периоды.Количество() = 0 Тогда
			Текст = "Для данного вида дичи не определены периоды охоты";
			Поле = "Объект.ВидДичи";
			ПоказатьСообщениеНаСервере(Текст,Поле);
			Возврат;
		Иначе
			Если Периоды.Найти(NULL,"РазоваяДатаНачала") <> Неопределено Тогда
				Текст = "Не заполнен производственный календарь на период охоты";
				Поле = "Объект";
				ПоказатьСообщениеНаСервере(Текст,Поле);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Выборка =  Результат.Выбрать();
	
	МассивПериодов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПериодов.Добавить("с " + Формат(Выборка.ДатаНачала, "ДФ ='дд.ММ.гггг '") + " по " +  Формат(Выборка.ДатаОкончания, "ДФ ='дд.ММ.гггг'"));
	КонецЦикла;	
	
	Элементы.ПериодОхоты.СписокВыбора.ЗагрузитьЗначения(МассивПериодов);		
	
	Если ПериодОхоты = "" Тогда
		ПериодОхоты = ("с " + Формат(Объект.ДатаНачала, "ДФ ='дд.ММ.гггг '") + " по " +  Формат(Объект.ДатаОкончания, "ДФ ='дд.ММ.гггг'"));
	КонецЕсли;	
	//Элементы.ПериодОхоты.СписокВыбора.ЗагрузитьЗначения(мПериоды.ВыгрузитьКолонку("Имя"));
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если Объект.ДатаОкончания = '00010101' Тогда
		Возврат;
	КонецЕсли;	
	ОшибкиПериода = ПолучитьПроизвольныеПериодыОхоты(Объект.ВидДичи,Объект.СезонОхоты,Объект.ДатаНачала,Объект.ДатаОкончания,Объект.Дата,Элемент.Имя);
	Если ОшибкиПериода.Отказ Тогда
		Объект.ДатаНачала = '00010101';
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиПериода.ТекстОшибки);
	Иначе
		СтоимостьАктуальная = ПолучитьСтоимостьПутевки(ПолучитьПараметрыДанных());
		Объект.Стоимость = СтоимостьАктуальная;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Если Объект.ДатаНачала = '00010101' Тогда
		Возврат;
	КонецЕсли;
	ОшибкиПериода = ПолучитьПроизвольныеПериодыОхоты(Объект.ВидДичи,Объект.СезонОхоты,Объект.ДатаНачала,Объект.ДатаОкончания,Объект.Дата,Элемент.Имя);
	Если ОшибкиПериода.Отказ Тогда
		Объект.ДатаОкончания = '00010101';
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиПериода.ТекстОшибки);		
	Иначе
		СтоимостьАктуальная = ПолучитьСтоимостьПутевки(ПолучитьПараметрыДанных());
		Объект.Стоимость = СтоимостьАктуальная;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроизвольныеПериодыОхоты(ВидДичи,СезонОхоты,ДатаНачала,ДатаОкончания,ДатаСреза,Элемент)
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Отказ",Ложь);
	
	Если ВидДичи.Пустая() Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки","Не заполнен вид дичи");
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ЦеныПоВидамДичи.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(ЦеныПоВидамДичи.ДатаОкончания) КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(
	|			&ДатаСреза,
	|			ВидДичи = &ВидДичи
	|				И СезонОхоты = &СезонОхоты) КАК ЦеныПоВидамДичи
	|
	|ИМЕЮЩИЕ
	|	НЕ МИНИМУМ(ЦеныПоВидамДичи.ДатаНачала) ЕСТЬ NULL  И
	|	НЕ МАКСИМУМ(ЦеныПоВидамДичи.ДатаОкончания) ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ВидДичи", ВидДичи);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("СезонОхоты", СезонОхоты);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки","Не определены периоды охоты");
		ДатаНачала = '00010101';
		ДатаОкончания = '00010101';
		Возврат СтруктураОтвета;
	КонецЕсли;	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();	
	
	Если ДатаНачала <> '00010101' И ДатаНачала < Выборка.ДатаНачала Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки",("Дата начала периода охоты не может быть ранее " + Формат(Выборка.ДатаНачала,"ДФ=dd.MM.yyyy")));
		ДатаНачала = Выборка.ДатаНачала;
		Возврат СтруктураОтвета;
	ИначеЕсли ДатаНачала > Выборка.ДатаОкончания Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки",("Дата начала периода охоты не может быть позже " + Формат(Выборка.ДатаОкончания,"ДФ=dd.MM.yyyy")));
		ДатаНачала = Выборка.ДатаНачала;
		Возврат СтруктураОтвета;
	ИначеЕсли ДатаОкончания <> '00010101' И ДатаОкончания < Выборка.ДатаНачала Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки",("Дата окончания периода охоты не может быть ранее " + Формат(Выборка.ДатаНачала,"ДФ=dd.MM.yyyy")));
		ДатаОкончания = Выборка.ДатаОкончания;
		Возврат СтруктураОтвета;
	ИначеЕсли ДатаОкончания > Выборка.ДатаОкончания Тогда
		СтруктураОтвета.Вставить("Отказ",Истина);
		СтруктураОтвета.Вставить("ТекстОшибки",("Дата окончания периода охоты не может быть позже " + Формат(Выборка.ДатаОкончания,"ДФ=dd.MM.yyyy")));
		ДатаОкончания = Выборка.ДатаОкончания;
		Возврат СтруктураОтвета;
	ИначеЕсли ДатаНачала > ДатаОкончания И ДатаОкончания <> '00010101' Тогда
		Если Элемент = "ДатаНачала" Тогда
			СтруктураОтвета.Вставить("Отказ",Истина);
			СтруктураОтвета.Вставить("ТекстОшибки","Дата начала периода охоты не может быть позже даты окончания");
			ДатаНачала = '00010101';
			Возврат СтруктураОтвета;
		ИначеЕсли Элемент = "ДатаОкончания" Тогда
			СтруктураОтвета.Вставить("Отказ",Истина);
			СтруктураОтвета.Вставить("ТекстОшибки","Дата окончания периода охоты не может быть раньше даты начала");
			ДатаОкончания = '00010101';
			Возврат СтруктураОтвета;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
	
КонецФункции	

&НаСервере
Функция ПолучитьПараметрыДанных()
	Результат = Новый Структура("СезонОхоты,Охотхозяйство,МестоОхоты,Охотник,ВидДичи,Сезонная,ДатаНачала,ДатаОкончания,Дата");
	ЗаполнитьЗначенияСвойств(Результат,Объект);
	Результат.Вставить("ВозрастнойПорог",Константы.ВозрастнойПорогЛьготнойСтоимости.Получить());
	Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура ОхотхозяйствоПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура МестоОхотыПриИзменении(Элемент)
	СтоимостьАктуальная = ПолучитьСтоимостьПутевки(ПолучитьПараметрыДанных());
	Объект.Стоимость = СтоимостьАктуальная;
	
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОхотникПриИзменении(Элемент)
	СтоимостьАктуальная = ПолучитьСтоимостьПутевки(ПолучитьПараметрыДанных());
	Объект.Стоимость = СтоимостьАктуальная;
	
	УстановитьДоступностьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура СезоннаяПриИзменении(Элемент)
	Объект.ДатаНачала = '00010101';
	Объект.ДатаОкончания = '00010101';
	
	ПериодОхоты = "";
	Элементы.ПериодОхоты.СписокВыбора.Очистить();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДичиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.ВидДичи = ВыбранноеЗначение;
	ПолучитьПериодыОхоты();	
	УстановитьДоступностьЭлементов();
	ПроизвольныйПериодПриИзменении(Элемент)
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Если ИмяСобытия = "ВыборРазрешения" Тогда
	//	Если Тип(Источник) = Тип("УправляемаяФорма") Тогда
	//		Если Объект.Охотник.Пустая() И Объект.ВидДичи.Пустая() Тогда
	//		    ЗаполнитьОбъект(Параметр);
	//			Записать();
	//			СтоимостьАктуальная =  ПолучитьСтоимостьПутевки(ПолучитьПараметрыДанных());
	//			Объект.Стоимость = СтоимостьАктуальная;
	//			ПриОткрытии(Ложь);
	//		Иначе
	//			Описание = Новый ОписаниеОповещения("ОбработкаОповещенияЗавершение",ЭтаФорма,Параметр);
	//			ПоказатьВопрос(Описание,"Документ не пустой. Продолжить?",РежимДиалогаВопрос.ДаНет);
	//		КонецЕсли;
	//	КонецЕсли;	
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура  ОбработкаОповещенияЗавершение(Результат,Параметр) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьОбъект(Параметр);
		ПриОткрытии(Ложь);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьОбъект(Параметр)
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ЗаполнитьЗначенияСвойств(ДокОбъект,Параметр,,"Ссылка,Ответственный,Номер");
	ДокОбъект.ДокументОснование = Параметр;
	БезПроверки = Параметр.БезПроверки;
	ЗначениеВРеквизитФормы(ДокОбъект,"Объект");
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПроверитьКорректностьПодбора(Разрешение,Путевка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(РазрешениеНаОхоту.Ссылка) КАК Разрешение
		|ИЗ
		|	Документ.РазрешениеНаОхоту КАК РазрешениеНаОхоту
		|ГДЕ
		|	РазрешениеНаОхоту.Ссылка = &Разрешение
		|	И РазрешениеНаОхоту.ПутевкаДоговор <> &Путевка
		|	И РазрешениеНаОхоту.Проведен";
	
	Запрос.УстановитьПараметр("Путевка", Путевка);
	Запрос.УстановитьПараметр("Разрешение", Разрешение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Разрешение = Выборка.Разрешение;
	
	Возврат Ложь;
	
КонецФункции	

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если НЕ ПроверитьКорректностьПодбора(ВыбранноеЗначение,Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Разрешение " + ВыбранноеЗначение + " уже является основанием для другой путевки.");
		Возврат;
	КонецЕсли;	
	
	Если Тип(ИсточникВыбора) = Тип("УправляемаяФорма") Тогда
		Если Объект.Охотник.Пустая() И Объект.ВидДичи.Пустая() Тогда
			ЗаполнитьОбъект(ВыбранноеЗначение);
			Записать();
			СтоимостьАктуальная =  ПолучитьСтоимостьПутевки(ПолучитьПараметрыДанных());
			Объект.Стоимость = СтоимостьАктуальная;
			ПриОткрытии(Ложь);
		Иначе
			Описание = Новый ОписаниеОповещения("ОбработкаОповещенияЗавершение",ЭтаФорма,ВыбранноеЗначение);
			ПоказатьВопрос(Описание,"Документ не пустой. Продолжить?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
